package by.training.epam.regExEditor.controller;

public class RegExController {

    public void run(){

        String text="Так говорила в июле 1805 года известная Анна Павловна Шерер, фрейлина и приближенная " +
                "императрицы Марии Феодоровны, встречая важного и чиновного князя Василия, первого приехавшего на " +
                "ее вечер. Анна Павловна кашляла несколько дней, у нее был грипп, как она говорила (грипп был тогда " +
                "новое слово, употреблявшееся только редкими). \n " +
                "Он говорил на том изысканном французском языке, на котором не только говорили, но и думали " +
                "наши деды, и с теми, тихими, покровительственными интонациями, которые свойственны состаревшемуся " +
                "в свете и при дворе значительному человеку. Он подошел к Анне Павловне, поцеловал ее руку, " +
                "подставив ей свою надушенную и сияющую лысину, и покойно уселся на диване.\n " +
                "Как можно быть здоровой... когда нравственно страдаешь? Разве можно, имея чувство, оставаться " +
                "спокойною в наше время? — сказала Анна Павловна. — Вы весь вечер у меня, надеюсь?";


    }
}
